module.exports = {
    name: 'lanna',
    description: "Chaigairay",
    execute(message, args){
        message.channel.send('เอ้ยบ่ะน้อย เฮาว่าคิงมาผิดตี้เฮียล่ะ มุหนังควายจีมีแฮงปู้นแฮงเพิ้กเน่อ ฆวยบ่ะ โอ๊โอ้อิหยังบ่ะหนังควาย ฮากะฮิงขะจะได้ยอกกันสักกำบ่สะลี้บ่ะเดวเพ่ถ้าคิงกึ๊ดว่าคิงเเข็งขนาด เออ เอากะบะคิงมาเลย คิงจะถอดเสี้ยนหนังฮันออกก้ เดี๋ยวเฮาถอดเสี้ยถอดเตี่ยวฮะก่อน เดี๋ยวเฮาจะใส่กันบนสะลีเนี่ย (มาเลยบ่มีปัญหา)คิงว่าได๋ คิงได๋ก้า ถอดชุดฟ้อนเตียนฮั่นเลยหนา (เออบ่ะหลวกหลวง) เฮาจะยะฮึคิงพอว่าไผคุมโรงยิมเเห่งนี้ https://www.youtube.com/watch?v=vX_v5_a17Xs');
    }
}