const { MessageEmbed } = require("discord.js");

module.exports = {
  name: "rules",
  description: "rules",
  execute(message) {
    let helpEmbed = new MessageEmbed()
      .setTitle("รัฐธรรมนูญเพื่อการอยู่ร่วมกันอย่างมีสันติ")
      .setDescription("ฉบับที่ 3")
      .setColor("#F8AA2A")
      .addFields(
        { name: 'หมวด 1 บททั่วไป', value: '1. เซิร์ฟเวอร์นี้ปกครองด้วยระบอบประชาธิปไตย โดยมีเลขาธิการคณะนักเรียนมาร์กซิสต์ (General Secretary) ซึ่งได้รับเลือกมาจากสมาชิกเซิร์ฟเวอร์ตามกระบวนการประชาธิปไตย เป็นผู้บัญญัติรัฐธรรมนูญนี้ไว้ ดังนั้นรัฐธรรมนูญนี้จึงมีผลบังคับใช้กับทุกคน และท่านเลขาธิการมีอำนาจในการแก้ไขได้ทุกเมื่อ เพื่อให้สมาชิกลงประชามติและนำไปบังคับใช้ต่อไป' },
        { name: '\u200B', value: '2. การเลือกตั้งท่านเลขาธิการ จะเกิดขึ้นต่อเมื่อผู้ดำรงตำแหน่งเลขาธิการคนปัจจุบันจัดให้มีการเลือกตั้งเท่านั้น และผู้สมัครทุกคนจะต้องได้รับความเห็นชอบจากท่านเลขาธิการคนปัจจุบันก่อน' },
        { name: '\u200B', value: "3. คณะรักษาความสงบแห่งเซิร์ฟเวอร์ (Server's Council of Peace & Order) หรือเทียบเท่า จะถูกแต่งตั้งโดยท่านเลขาธิการ มีอำนาจในการบริหารจัดการเซิร์ฟเวอร์ในนามท่านเลขาธิการ และแต่งตั้งยศ (role) ที่เหมาะสมให้กับสมาชิกใหม่ ทั้งนี้จะต้องไม่ขัดต่อมาตรา 4 ของรัฐธรรมนูญฉบับนี้" },
        { name: '\u200B', value: "\u200B"},
        { name: 'หมวดที่ 2 กฎกติกา', value: '4. สมาชิกทุกคนมีสิทธิ เสรีภาพ ในการใช้เซิร์ฟเวอร์ได้ตามใจต้องการ ตราบใดที่\n>>> ก.) ไม่ละเมิดสิทธิ เสรีภาพ และ/หรือทำร้ายจิตใจสมาชิกผู้อื่น\nข.) ไม่ก่อให้เกิดความขัดแย้งอย่างรุนแรงในหมู่สมาชิก\nค.) ไม่โพสต์เนื้อหาที่ไม่อยู่ในคุณธรรม จริยธรรม และศีลธรรมอันดีงาม ในช่องสนทนาอื่นนอกเหนือจากช่องที่กำหนดไว้ด้วยแท็ก NSFW เท่านั้น\nง.) ไม่กระทำการใดๆ ให้ท่านเลขาธิการเสื่อมเสียชื่อเสียง ศักดิ์ศรี เกียรติยศ  หรือขัดประสงค์ของท่านเลขาธิการ\nจ.) ไม่ก่อให้เกิดมลพิษทางเสียงแก่ผู้อื่น เว้นแต่อุปกรณ์ของผู้นั้นมีปัญหา หรือเป็นเหตุที่ผู้กระทำไม่มีเจตนาให้เกิดขึ้น\nฉ.) ไม่สแปมข้อความและ/หรือการแท็กในช่องสนทนา\nช.) ไม่ใช้อำนาจที่ได้รับมาตามยศ (role) ของตนในทางที่มิชอบ\nซ.) ไม่กระทำการใดๆ อันเป็นการล้มล้างรัฐธรรมนูญ ตามที่ระบุไว้ในมาตรา 1 ของรัฐธรรมนูญฉบับนี้' },
        { name: '\u200B', value: '5. การใช้คอมมานด์บอททุกตัว ให้ใช้ตามความเหมาะสมตามแต่สถานการณ์ ห้ามใช้ในที่ที่ไม่ถูกไม่ควรเด็ดขาด' },
        { name: '\u200B', value: "\u200B"},
        { name: 'หมวดที่ 3 การบังคับใช้รัฐธรรมนูญและกระบวนการยุติธรรม', value: '6. หากสงสัยว่ามีการกระทำความผิดตามที่บัญญัติไว้ในหมวดที่ 2 ของรัฐธรรมนูญฉบับนี้ ให้ใช้กระบวนการยุติธรรมเพื่อหาข้อเท็จจริงตาม 3 กรณีดังต่อไปนี้\n>>> ก.) ให้สมาชิกลงความเห็นว่าการกระทำผิดนั้นขัดต่อมาตรา 4 และ/หรือ 5 หรือไม่ และพิจารณาเลือกบทลงโทษเสนอต่อท่านเลขาธิการ หรือคสซ.ตามเห็นสมควร\nข.) ให้คณะรักษาความสงบแห่งเซิร์ฟเวอร์หรือตำแหน่งที่เทียบเท่าสอบสวนการกระทำผิดอย่างยุติธรรม และพิจารณาลงโทษตามสมควร\nค.) ท่านเลขาธิการมีสิทธิสอบสวนการกระทำผิด และลงโทษตามเห็นสมควร' },
        { name: '\u200B', value: "\u200B"},
        { name: 'ทั้งนี้ การตัดสินใจของท่านเลขาธิการถือเป็นที่สิ้นสุด', value: 'ประกาศใช้ ณ วันที่ 1 ธันวาคม 2564' },
      );

    helpEmbed.setTimestamp();
    return message.channel.send(helpEmbed).catch(console.error);
  }
};