const config = require("../config.json");

module.exports = {
    name: 'rules',
    description: "Rules",
    execute(message, args){
        if (args == 'help') {
            message.channel.send(`Usage ${config.PREFIX}rules`);
        }else {
            message.channel.send("สนธิสัญญาการปกครองเซิร์ฟเวอร์โดยรัฐธรรมนูญตามระบอบประชาธิปไตย");
            message.channel.send("https://media.discordapp.net/attachments/860324801536983043/880652247057448980/e2998aee5a81d42b_Page_1.png?width=478&height=676");
            message.channel.send("https://media.discordapp.net/attachments/860324801536983043/880652259166416906/e2998aee5a81d42b_Page_2.png?width=478&height=676");
            message.channel.send("https://media.discordapp.net/attachments/860324801536983043/880652264883249243/e2998aee5a81d42b_Page_3.png?width=478&height=676");
        }
    }
}

// const { MessageEmbed } = require("discord.js");

// module.exports = {
//   name: "test",
//   aliases: ["t"],
//   description: "test",
//   execute(message) {
//     let helpEmbed = new MessageEmbed()
//       .setTitle("ธรรมนูญเพื่อการอยู่ร่วมกันอย่างมีสันติ")
//       .setDescription("ฉบับที่ 3 (ฉบับร่าง)")
//       .setColor("#F8AA2A")
//       .addFields(
//         { name: 'หมวด 1 บททั่วไป', value: '1. เซิร์ฟเวอร์นี้ปกครองด้วยระบอบประชาธิปไตยอันมีผู้นำ ซึ่งเป็นที่รักของทุกคน ได้รับเลือกมาจากสมาชิกเซิร์ฟเวอร์ตามกระบวนการประชาธิปไตย เป็นผู้บัญญัติธรรมนูญนี้ไว้ ดังนั้นธรรมนูญนี้จึงมีผลบังคับใช้กับทุกคน และท่านผู้นำมีอำนาจในการแก้ไขได้ทุกเมื่อ' },
//         { name: '\u200B', value: '2. การเลือกท่านผู้นำ จะเกิดขึ้นต่อเมื่อผู้นำคนปัจจุบันจัดให้เกิดการเลือกตั้งเท่านั้น' },
//         { name: '\u200B', value: "3. คณะรักษาความสงบแห่งเซิร์ฟเวอร์(Server's Council of Peace & Order)(คสซ.) หรือเทียบเท่า จะถูกแต่งตั้งโดยท่านผู้นำ และมีอำนาจในการบริหารจัดการเซิร์ฟเวอร์ในนามท่านผู้นำ" },
//         { name: 'หมวดที่ 2 กฎกติกา', value: '4. สมาชิกทุกคนมีสิทธิ เสรีภาพ ในการใช้เซิร์ฟเวอร์ได้ตามใจต้องการ ตราบใดที่' },
//         { name: '\u200B', value: '> ก.) ไม่ละเมิดสิทธิ เสรีภาพ และ/หรือทำร้ายจิตใจสมาชิกผู้อื่น' },
//         { name: '\u200B', value: '> ข.) ไม่ก่อให้เกิดความขัดแย้งอย่างรุนแรงในหมู่สมาชิก' },
//         { name: '\u200B', value: '> ค.) ไม่โพสต์เนื้อหาที่ไม่อยู่ในคุณธรรม จริยธรรม และศีลธรรมอันดีงาม ในช่องสนทนาอื่นนอกเหนือจากช่องที่กำหนดไว้ด้วยแท็ก NSFW เท่านั้น' },
//         { name: '\u200B', value: '> ง.) ไม่กระทำการใดๆ ให้ท่านผู้นำเสื่อมเสียชื่อเสียง ศักดิ์ศรี เกียรติยศ  หรือขัดประสงค์ของท่านผู้นำ' },
//         { name: '\u200B', value: '> จ.) ไม่ก่อให้เกิดมลพิษทางเสียงแก่ผู้อื่น เว้นแต่อุปกรณ์ของผู้นั้นมีปัญหา หรือเป็นเหตุที่ผู้กระทำไม่มีเจตนาให้เกิดขึ้น' },
//         { name: '\u200B', value: '> ฉ.) ไม่สแปมข้อความและ/หรือการแท็ก' },
//         { name: '\u200B', value: '> ช.) ไม่ใช้อำนาจที่ได้รับมาตามตำแหน่ง (role) ของตนในทางที่มิชอบ' },
//         { name: '\u200B', value: '> ซ.) ไม่กระทำการใดๆ อันเป็นการล้มล้างรัฐธรรมนูญ ตามที่ระบุไว้ในมาตรา 1 ของรัฐธรรมนูญฉบับนี้ ' },
//         { name: '\u200B', value: '5. การใช้คอมมานด์บอททุกตัว ให้ใช้ตามความเหมาะสมตามแต่สถานการณ์ ห้ามใช้ในที่ที่ไม่ถูกไม่ควรเด็ดขาด' },
//         { name: 'หมวดที่ 3 การบังคับใช้และกระบวนการยุติธรรม', value: '6. หากมีการกระทำความผิดตามที่บัญญัติไว้ในหมวดที่ 2 ของธรรมนูญนี้ ให้ดำเนินการได้ 3 กรณีดังต่อไปนี้' },
//         { name: '\u200B', value: '> ก.) ให้สมาชิกลงความเห็นว่าการกระทำผิดนั้นขัดต่อมาตรา 4 และ/หรือ 5 หรือไม่ และพิจารณาเลือกบทลงโทษเสนอต่อท่านผู้นำ หรือคสซ.ตามเห็นสมควร' },
//         { name: '\u200B', value: '> ข.) ให้คสซ. หรือตำแหน่งที่เทียบเท่าสอบสวนการกระทำผิดอย่างยุติธรรม และพิจารณาลงโทษตามสมควร' },
//         { name: '\u200B', value: '> ค.) ท่านผู้นำมีสิทธิสอบสวนการกระทำผิด และลงโทษตามเห็นสมควร' },
//         { name: 'ทั้งนี้ การตัดสินใจของท่านผู้นำถือเป็นที่สิ้นสุด', value: 'ประกาศใช้ ณ วันที่ x' },
//       );

//     helpEmbed.setTimestamp();
//     return message.channel.send(helpEmbed).catch(console.error);
//   }
// };